
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
  	 СторокаСТоваром = Элементы.Товары.ТекущиеДанные;
	 СторокаСТоваром.СуммаНДС =  ПолучитьСуммуНДС(СторокаСТоваром.Цена * СторокаСТоваром.Количество, ПолучитьСтавкуНДС());
	 СторокаСТоваром.СуммаПродажи = РасчетСуммы(СторокаСТоваром.Цена, СторокаСТоваром.Количество);
 КонецПроцедуры
 
 
 Функция РасчетСуммы(Цена, Количество);
	  Сумма =  Цена * Количество;
	  СуммаНДС = ПолучитьСуммуНДС(Сумма,ПолучитьСтавкуНДС());
      Возврат Сумма + СуммаНДС;	 
 КонецФункции
 
 Функция ПолучитьСуммуНДС(Сумма, СтавкаНДС);
	 Возврат Сумма / 100 * СтавкаНДС;	 
КонецФункции

Функция ПолучитьСтавкуНДС()
	
	Возврат Константы.СтавкаНДС.Получить();
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	 СторокаСТоваром = Элементы.Товары.ТекущиеДанные;
	 СторокаСТоваром.СуммаНДС =  ПолучитьСуммуНДС(СторокаСТоваром.Цена * СторокаСТоваром.Количество, ПолучитьСтавкуНДС());
	 СторокаСТоваром.СуммаПродажи = РасчетСуммы(СторокаСТоваром.Цена, СторокаСТоваром.Количество);
КонецПроцедуры

